Repository: mozilla-l10n/mt-training-data
Catalog: eko/eko_pontoon.tmx
Source language: en_us
Languages: eko

source: Sentences contributed here will be added to a publicly available cc-0 licensed dataset.
eko: Farazi zooxhi zilaziwe zintela ophakanyiwa neepile kiina zinlawaye wooniwa naatthu awaatta cc-0.

source: { $sentences } sentences reviewed. Thank you!
eko: { $sentences } Yarutela wooniya farazi zooxi. Kaxukhuru!

source: Sentence Variant
eko: Farasi yawiyana luuka soovirikana

source: Separate sentences into one line by pressing “Enter” or “Return” once
eko: Mwakanyule farazi ziriye liinya nttithaka “Enter” wala “Return” cooxhi moote

source: Service and Retail
eko: Khaazi ni wuuzanyisa avareeeju

source: Share Common Voice
eko: Mwawanye huula yaatthu

source: Share your clip
eko: Mwawanye kilipi yenu

source: Shortcuts
eko: Tarikhi yookhuveya

source: [Should be ‘dinosaurs’]
eko: [Enaye wiiya ‘Tinosawuru’]

source: [Should be “We are”]
eko: [Enaye wiiya “ya maati”]

source: Single
eko: Farazi moote

source: Single sentence submission
eko: Operekha farazi vaara vamote

source: Skip
eko: Wiirukha

source: Small batch
eko: Nikhuru nttithiiru

source: Small batch sentence submission
eko: Operekha farazi vattithi vattitthi

source: Source: { $sentenceSource }
eko: Nphattuwelo: { $sentenceSource }

source: Speak
eko: Ottakhula

source: Speak now
eko: Nttakhule nasaapi

source: Speak options menu
eko: Menu sa vithu zoolupiwa

source: Start recording
eko: Waaza karavasawu

source: <strong>[Crackle]</strong> giant dinosaurs of <strong>[crackle]</strong> -riassic.
eko: <strong>[Estalu]</strong> tinosawuru awulweene <strong>[estalu]</strong> -riyasiko.

source: <strong>[Sneeze]</strong> The giant dinosaurs of the <strong>[cough]</strong> Triassic.
eko: <strong>[Nvumulo]</strong> Tinosawuru awulweene sa <strong>[Elapaha]</strong> Triyasiko.

source: Submit
eko: Operekha

source: Submit a new question for the community to read and respond to
eko: Wiiviyari zawuzela kiina para osoma ni ocipu okomunitaati

source: Submit a report
eko: Operekha mattakhuzi

source: Submit clips
eko: Wiiviyari kilipi

source: Submit new questions for the community to read and respond to
eko: Mwinviyari zaawuzela kiina yoori akumunitaati esome ni watikhe

source: Success
eko: Zooxhapweya

source: success checkmark
eko: nlama enonisawe owula

source: Swipe right to approve the sentence. Swipe left to reject it. Swipe up to skip it. <strong>Do not forget to submit your review!</strong>
eko: Nthitthe laato tireeto yoori mwaporovari farazi. Nthitthe para eskereta yoori mukatthale . Nthitthe para ottulu yooro mwiirukhe<strong> Mwihisahawu operekha etile muruteliyeyo woona!</strong>

source: Taking several attempts to read a word.
eko: Omananisa mananna sawatta osoma nttakhuzi.

source: Tap
eko: Woovuma

source: Technology and Robotics
eko: Tekonologiya ni ropotika

source: Thank you for contributing your bulk submission!
eko: Naxuukhuru wiiya munnikholisa winviyari nikhuru!

source: Thank you for contributing your voice!
eko: Naxhukhurela mwaasa wiikhelela huula yenu!

source: Thank you for donating your voice clips!
eko: Naxukhuru wiiya mwanimeela kilipi zeenu za huula

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
eko: Naxukhurela karavasayu zenu!<lineBreak></lineBreak> Nrevisari ni mwiiviyari ziri vathi.

source: Thank you for your voice information
eko: Naxukhurela hapari zenu za huula

source: The bumblebee sped by.
eko: Nyuukhi savira nawakuva.

source: The clip has disrespectful or offensive language.
eko: Vitiyu anaye mattakhuzi ottukhana wala oveyisa

source: The giant dinosaur of the Triassic.
eko: Tinosawuru awulweene a Triyasiko.

source: The giant dinosaurs of the Triassi-.
eko: Tinosawuru awulweene a Triyasi-.

source: The giant dinosaurs of the Triassic.
eko: Tinosawuru awulweene a Triyasiko

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
eko: Tinosawuru awulweene wa Triyasiko. <strong>[yoosomiwa na huula moote]</strong>

source: The giant dinosaurs of the Triassic. Yes.
eko: Tinosawuru awulweene a Triyasiko. Aaye.

source: The giant dino <strong>[cough]</strong> the Triassic.
eko: Tinosawuru awulweene sa <strong>[elapaha]</strong> Triyasiko.

source: There are currently no sentences to review in this language.
eko: Nasapi eti, luuka eti khina farazi yoori nirevisari.

source: The recording was too long.
eko: Karavasayu eri yoolepa

source: The recording was too quiet.
eko: Karavasayu eri vulume ttitthiru.

source: The recording was too short.
eko: Karavasayu eri yoofhupheya.

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
eko: Khula namosoma onsoma manaanawe. Mmana moona yoori vuluume tiyoonyakula yoovikana karavasayu, mukatthale wala (yoocuweyasa) mmana evuma vattitthiru nhisala osila epile sunlupiwale yoohilottela textu yawaatikhiwa.

source: The Sentence Collector is moving to the core Common Voice platform. You can now <writeURL>write</writeURL> a sentence or <reviewURL>review</reviewURL> single sentence submissions on Common Voice.
eko: Namalokotthela farazi ontta waaza yeetta mpalataforuma wa huula yaatthu . Nasaapi etiti poti <writeURL>waatikha</writeURL> farazi moote wala <reviewURL>orutela woona</reviewURL> Operekha farazi moote ya huula yaatthu.

source: The sentence has a grammatical or spelling error.
eko: Farazi tiyovonyiwa watikhiwa wala karamatika.

source: The sentence has disrespectful or offensive language.
eko: Farazi eti ti yottukhana wala entana mattakhuzi oveyisa

source: The sentence must be grammatically correct.
eko: Farazi enaaye wiiya kramatikalmenti yoolikana saana.

source: The sentence must be speakable.
eko: Esala elupeya farazi.

source: The sentence must be spelled correctly.
eko: Farazi enaye waatikhiwa saanene.

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex.
eko: Khinkhanyereriwa otana hapari epi. Mwekezele paasi mmana mwiicoona saana. Mmana nilaleya nikhuru za hapari, hapari nkhama nzina, email nittela ovitha zooxi, ni khaninlawa woonisela nyaakha wala soola (nkhama nlume wala muukha).

source: Three to go!
eko: Ttatthu, nlawe

source: Too many files
eko: Arkiivu awaatta

source: Transcribe audio recordings
eko: Watikha karavasayu za ayutiyu na luuka yawo

source: Transcribe audio recordings into text
eko: Waatikha epili zookaravariwa na ayutiyu

source: Try again by dragging your file here
eko: Mmananise theenya muupurulaka arikivu eenu para apha

source: Try uploading again
eko: Mmananise wiiviyari theenya

source: Understand contribution criteria
eko: Mwisileze tarikhi soovira za nsokho

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
eko: Mucuwe yoori wekesa osila kilipi wa huula enaajutari yoori karavasayu zeeno ziiye zoothajiri

source: Upload aborted. Do you want to delete your recordings?
eko: Wiiviyari za waportaatu. Mwiitakha ofyuca karavasayu zenu?

source: { $uploadedSentences } of { $totalSentences } sentences collected
eko: { $uploadedSentences } { $totalSentences } naxhuma farazi

source: { $uploadedSentences } of { $totalSentences } sentences collected. Click <downloadLink>here</downloadLink> to download rejected sentences.
eko: { $uploadedSentences } de { $totalSentences } farazi zooxhumiwa. Ntthitte <downloadLink>apha</downloadLink> Para opaxari farazi zookatthaliwa.

source: Upload failed, please retry.
eko: Khayiiviyareweene, muruttele wiiviyari thennya.

source: Upload <icon></icon> public domain sentences
eko: Operekha <icon></icon>farazi yoocuwiwa ni atthu awaatta

source: Upload in progress...
eko: Nalelo entta weettetta epile zawiiviyariwa...

source: Upload more sentences?
eko: Winviyari farazi zikina?

source: Use correct grammar
eko: Yatikhana karamatika yoolikana

source: Use correct spelling and punctuation
eko: Yaatikhana mwaatikhelo ni pontu zoolikana

source: Validate Readings
eko: Ovalitari zoosoma

source: Validate Readings, Review Transcriptions
eko: ovalitari zoosoma, oruutela woona soottakhuliwa ni khwatikhiwa

source: Validate Readings <small>(Coming soon)</small>
eko: Ovalitari zoosoma <small>(nasaapi)</small>

source: Validate readings submitted by community members
eko: Ovalitari zoosoma zootaniwa na nikhuru nokomunitaati

source: Validate user-recorded readings in your language
eko: Ovalitari zoosoma sookaravariwa ni atthu na luuka zaya

source: Varying Pronunciations
eko: Sinttakhuliwa mananna ovirikana.

source: Volume
eko: Vuluume

source: Want to save your information? <createProfile>Create a profile</createProfile>
eko: Mwiitakha opeha hapari zenu? <createProfile>Nkiriyari perfili moote</createProfile>

source: We are going out to get a coffee.
eko: Olawa nisaruwe nalye kafe.

source: We are going out to get coffee.
eko: Olawa nisaruwe nalye kafe.

source: We couldn’t get any audio clips for you to listen to. Please try again later.
eko: Khanipattheene kilipi za awutiyu para weeyo osiila. Orutele woona woora nkina.

source: We couldn’t get any sentences for you to speak. Please try again later.
eko: Khanoneeni farazi para mweeyo ottakhule. Nkhanyerere okatthi nkina.

source: We may have run out of clips - refresh the page, or try again later.
eko: Fyeeyo khanina kilipi para ovalitari ya luuka eti...

source: We’re going out to get coffee.
eko: kinttela olya koopho moote ya maati.

source: We're making some big changes
eko: Niiretta zooxhapweya khuluyeene

source: We’re sorry, your platform is not currently supported.
eko: Mwinishamihe, masi palataforuma yenu khistaweeni olemela.

source: We've run out of sentences to record in this language...
eko: Fheeyo khanina farazi para okaravari luuka eti...

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
eko: Nintakha yoori alokaritimu yooloza za makina zisala sikhitiri okhola khanzi na manyakunyaku okutokuto. Manyakunyaku pooti otakhiwa, yeeyaru yoori khikhattaza osiila textu yooxhi. Muuzika yohinyakula ori saana. Muuzika woonyakula onkhattazaye osiileza pelu menuji noolumo nimote, wala.

source: What issues are you experiencing with this sentence?
eko: Farazi eti enaaye niini yoovila?

source: What needs to be in my file?
eko: Kintakhaye yoori yiyemo marikivu mwaka niini?

source: What sentences can I add?
eko: Kekezele na farasi tiivi?

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
eko: Mwisileze saana, moonesese nkhama epile ekaravariwe eri etthipile saawatikhiwa; mukathale mmana moona yoori yavonyeya <br />: Muthevo epile soovonyeya vatithiru.

source: Why are you asking?
eko: Mwinuuzela mwaasa?

source: With a profile, you can keep track of your activity and connect with a community of voice data contributors.
eko: Na perfili moote, mweeyo pooti yoona mananna zinettettaye khazizenu ni mwiniwoona apale anuukholisaweni khaazi amperekhaye tatu za huula.

source: Write
eko: Waatikha

source: Write options menu
eko: Menu za vitthu soowatikhiwa

source: y
eko: s

source: Y
eko: S

source: Yes
eko: Aaye

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
eko: Weeyo pooti okholana khaazi atalyo za putawu: { sc-review-form-button-approve-shortcut } para waaporovari, { sc-review-form-button-reject-shortcut } para okathala, { sc-review-form-button-skip-shortcut } para wurukha

source: You cannot add multiple sentences for a single submission
eko: Nhivinyari farazi saawatta vaara vamoote

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
eko: Weeyo khunathawule nne luuka. Olawe operifili waawe <profileLink>Perifili</profileLink>para othawula luuka.

source: You have reached the submission limit for this page. Please wait for { $retryLimit } minutes before submitting another sentence. Thank you for your patience!
eko: Weeyo wavikana okhupi yoori mwinviyari pagina eti. Mwecele{ $retryLimit } minuutu ihinaaze winviyari farasi kiina Naxhukhurela mwaasa woovilela!

source: You have reached the submission limit for this page. Please wait for { $retryLimit } seconds before submitting another sentence. Thank you for your patience!
eko: Weeyo wavikana okhupi yoori mwinviyari pagina eti. M,wecele{ $retryLimit } sekuutu ihinaaze winviyari farasi kiina. Naxhukhurela mwaasa woovilela!

source: You must allow microphone access.
eko: Mwinaaye olikha yoori mikorofooni zilikariwe

source: You’re contributing to a target segment
eko: Mweeyo muntta okontiripuwiri para khazizetthu

source: You’re contributing to our first target segment
eko: Mweeyo muntta okontiribuwiri para khazizetthu soomwanzo

source: You're going too fast. Please take a moment to review the sentence to make sure it's correct.
eko: Khunstawene waakuva. Weemele vattithiri para orutele osoma ni woone nkhama zalikana sooxhi.

source: You're helping Common Voice reach our daily sentence goals!
eko: Mweeyo mwamwaajutari oosileza huula yaatthu wiixhixha okhola khaazi za farazi khula sinkhu!

source: Your language variant might be out of clips! If you’re comfortable, you can change your settings to see other sentences within your language.
eko: Luuka onttakhulaye khiina kilipi ya awutiyu! Mmana woona saana, pooti otthawuula manaana makina yoori moone farazi sikina sa luuka yenu.

source: Your language variant might be out of sentences! If you’re comfortable, you can change your settings to see other sentences within your language.
eko: Luuka yeno pooti ohina farazi! Mmana moona saana, pooti opatilisa vutthu sikina yoori moone farazi sikina ya luuka yenu.

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
eko: Mweeyo mwaajutari osileza huula yaatthu <goalPercentage></goalPercentage> Khazizetthu wakhula siikhu wa { $goalValue } Wa karavasayu!

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
eko: Mweeyo mwanajutari osileza huula yaatthu <goalPercentage></goalPercentage> Khazizetthu wakhula siikhu { $goalValue } Waporovari!
